ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>Main PLL entry clock source
Set and cleared by software to select PLL clock source. These bits can be written only when PLL is disabled.
In order to save power, when no PLL is used, the value of PLLSRC should be 00.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLSRC</name>
                <enumeratedValue>
                  <name>None</name>
                  <description>No clock sent to PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 sent to PLL input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE sent to PLL input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLM</name>
              <description>Division factor for the main PLL input clock
Set and cleared by software to divide the PLL input clock before the VCO. These bits can be written only when all PLLs are disabled.
VCO input frequency = PLL input clock frequency / PLLM with 1 &lt;= PLLM &lt;= 16
...
Note: The software has to set these bits correctly to ensure that the VCO input frequency is within the range defined in the device datasheet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLM</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>pll_p_ck = vco_ck / 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>pll_p_ck = vco_ck / 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div3</name>
                  <description>pll_p_ck = vco_ck / 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>pll_p_ck = vco_ck / 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div5</name>
                  <description>pll_p_ck = vco_ck / 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>pll_p_ck = vco_ck / 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div7</name>
                  <description>pll_p_ck = vco_ck / 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>pll_p_ck = vco_ck / 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div9</name>
                  <description>pll_p_ck = vco_ck / 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>pll_p_ck = vco_ck / 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div11</name>
                  <description>pll_p_ck = vco_ck / 11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>pll_p_ck = vco_ck / 12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div13</name>
                  <description>pll_p_ck = vco_ck / 13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div14</name>
                  <description>pll_p_ck = vco_ck / 14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div15</name>
                  <description>pll_p_ck = vco_ck / 15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>pll_p_ck = vco_ck / 16</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLN</name>
              <description>Main PLL multiplication factor for VCO
Set and cleared by software to control the multiplication factor of the VCO. These bits can be written only when the PLL is disabled. 
VCO output frequency = VCO input frequency x PLLN with 8 =&lt; PLLN =&lt; 127
...
...
Note: The software has to set correctly these bits to assure that the VCO output frequency is within the range defined in the device datasheet.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLN</name>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>pll_n_ck = vco_ck / 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div9</name>
                  <description>pll_n_ck = vco_ck / 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>pll_n_ck = vco_ck / 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div11</name>
                  <description>pll_n_ck = vco_ck / 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>pll_n_ck = vco_ck / 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div13</name>
                  <description>pll_n_ck = vco_ck / 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div14</name>
                  <description>pll_n_ck = vco_ck / 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div15</name>
                  <description>pll_n_ck = vco_ck / 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>pll_n_ck = vco_ck / 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div17</name>
                  <description>pll_n_ck = vco_ck / 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div18</name>
                  <description>pll_n_ck = vco_ck / 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div19</name>
                  <description>pll_n_ck = vco_ck / 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div20</name>
                  <description>pll_n_ck = vco_ck / 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div21</name>
                  <description>pll_n_ck = vco_ck / 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div22</name>
                  <description>pll_n_ck = vco_ck / 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div23</name>
                  <description>pll_n_ck = vco_ck / 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div24</name>
                  <description>pll_n_ck = vco_ck / 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div25</name>
                  <description>pll_n_ck = vco_ck / 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div26</name>
                  <description>pll_n_ck = vco_ck / 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div27</name>
                  <description>pll_n_ck = vco_ck / 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div28</name>
                  <description>pll_n_ck = vco_ck / 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div29</name>
                  <description>pll_n_ck = vco_ck / 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div30</name>
                  <description>pll_n_ck = vco_ck / 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div31</name>
                  <description>pll_n_ck = vco_ck / 31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32</name>
                  <description>pll_n_ck = vco_ck / 32</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div33</name>
                  <description>pll_n_ck = vco_ck / 33</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div34</name>
                  <description>pll_n_ck = vco_ck / 34</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div35</name>
                  <description>pll_n_ck = vco_ck / 35</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div36</name>
                  <description>pll_n_ck = vco_ck / 36</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div37</name>
                  <description>pll_n_ck = vco_ck / 37</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div38</name>
                  <description>pll_n_ck = vco_ck / 38</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div39</name>
                  <description>pll_n_ck = vco_ck / 39</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div40</name>
                  <description>pll_n_ck = vco_ck / 40</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div41</name>
                  <description>pll_n_ck = vco_ck / 41</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div42</name>
                  <description>pll_n_ck = vco_ck / 42</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div43</name>
                  <description>pll_n_ck = vco_ck / 43</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div44</name>
                  <description>pll_n_ck = vco_ck / 44</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div45</name>
                  <description>pll_n_ck = vco_ck / 45</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div46</name>
                  <description>pll_n_ck = vco_ck / 46</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div47</name>
                  <description>pll_n_ck = vco_ck / 47</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div48</name>
                  <description>pll_n_ck = vco_ck / 48</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div49</name>
                  <description>pll_n_ck = vco_ck / 49</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div50</name>
                  <description>pll_n_ck = vco_ck / 50</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div51</name>
                  <description>pll_n_ck = vco_ck / 51</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div52</name>
                  <description>pll_n_ck = vco_ck / 52</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div53</name>
                  <description>pll_n_ck = vco_ck / 53</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div54</name>
                  <description>pll_n_ck = vco_ck / 54</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div55</name>
                  <description>pll_n_ck = vco_ck / 55</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div56</name>
                  <description>pll_n_ck = vco_ck / 56</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div57</name>
                  <description>pll_n_ck = vco_ck / 57</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div58</name>
                  <description>pll_n_ck = vco_ck / 58</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div59</name>
                  <description>pll_n_ck = vco_ck / 59</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div60</name>
                  <description>pll_n_ck = vco_ck / 60</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div61</name>
                  <description>pll_n_ck = vco_ck / 61</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div62</name>
                  <description>pll_n_ck = vco_ck / 62</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div63</name>
                  <description>pll_n_ck = vco_ck / 63</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div64</name>
                  <description>pll_n_ck = vco_ck / 64</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div65</name>
                  <description>pll_n_ck = vco_ck / 65</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div66</name>
                  <description>pll_n_ck = vco_ck / 66</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div67</name>
                  <description>pll_n_ck = vco_ck / 67</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div68</name>
                  <description>pll_n_ck = vco_ck / 68</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div69</name>
                  <description>pll_n_ck = vco_ck / 69</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div70</name>
                  <description>pll_n_ck = vco_ck / 70</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div71</name>
                  <description>pll_n_ck = vco_ck / 71</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div72</name>
                  <description>pll_n_ck = vco_ck / 72</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div73</name>
                  <description>pll_n_ck = vco_ck / 73</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div74</name>
                  <description>pll_n_ck = vco_ck / 74</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div75</name>
                  <description>pll_n_ck = vco_ck / 75</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div76</name>
                  <description>pll_n_ck = vco_ck / 76</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div77</name>
                  <description>pll_n_ck = vco_ck / 77</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div78</name>
                  <description>pll_n_ck = vco_ck / 78</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div79</name>
                  <description>pll_n_ck = vco_ck / 79</description>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div80</name>
                  <description>pll_n_ck = vco_ck / 80</description>
                  <value>80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div81</name>
                  <description>pll_n_ck = vco_ck / 81</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div82</name>
                  <description>pll_n_ck = vco_ck / 82</description>
                  <value>82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div83</name>
                  <description>pll_n_ck = vco_ck / 83</description>
                  <value>83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div84</name>
                  <description>pll_n_ck = vco_ck / 84</description>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div85</name>
                  <description>pll_n_ck = vco_ck / 85</description>
                  <value>85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div86</name>
                  <description>pll_n_ck = vco_ck / 86</description>
                  <value>86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div87</name>
                  <description>pll_n_ck = vco_ck / 87</description>
                  <value>87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div88</name>
                  <description>pll_n_ck = vco_ck / 88</description>
                  <value>88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div89</name>
                  <description>pll_n_ck = vco_ck / 89</description>
                  <value>89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div90</name>
                  <description>pll_n_ck = vco_ck / 90</description>
                  <value>90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div91</name>
                  <description>pll_n_ck = vco_ck / 91</description>
                  <value>91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div92</name>
