ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
                  <description>pll_n_ck = vco_ck / 92</description>
                  <value>92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div93</name>
                  <description>pll_n_ck = vco_ck / 93</description>
                  <value>93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div94</name>
                  <description>pll_n_ck = vco_ck / 94</description>
                  <value>94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div95</name>
                  <description>pll_n_ck = vco_ck / 95</description>
                  <value>95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div96</name>
                  <description>pll_n_ck = vco_ck / 96</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div97</name>
                  <description>pll_n_ck = vco_ck / 97</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div98</name>
                  <description>pll_n_ck = vco_ck / 98</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div99</name>
                  <description>pll_n_ck = vco_ck / 99</description>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div100</name>
                  <description>pll_n_ck = vco_ck / 100</description>
                  <value>100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div101</name>
                  <description>pll_n_ck = vco_ck / 101</description>
                  <value>101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div102</name>
                  <description>pll_n_ck = vco_ck / 102</description>
                  <value>102</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div103</name>
                  <description>pll_n_ck = vco_ck / 103</description>
                  <value>103</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div104</name>
                  <description>pll_n_ck = vco_ck / 104</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div105</name>
                  <description>pll_n_ck = vco_ck / 105</description>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div106</name>
                  <description>pll_n_ck = vco_ck / 106</description>
                  <value>106</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div107</name>
                  <description>pll_n_ck = vco_ck / 107</description>
                  <value>107</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div108</name>
                  <description>pll_n_ck = vco_ck / 108</description>
                  <value>108</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div109</name>
                  <description>pll_n_ck = vco_ck / 109</description>
                  <value>109</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div110</name>
                  <description>pll_n_ck = vco_ck / 110</description>
                  <value>110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div111</name>
                  <description>pll_n_ck = vco_ck / 111</description>
                  <value>111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div112</name>
                  <description>pll_n_ck = vco_ck / 112</description>
                  <value>112</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div113</name>
                  <description>pll_n_ck = vco_ck / 113</description>
                  <value>113</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div114</name>
                  <description>pll_n_ck = vco_ck / 114</description>
                  <value>114</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div115</name>
                  <description>pll_n_ck = vco_ck / 115</description>
                  <value>115</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div116</name>
                  <description>pll_n_ck = vco_ck / 116</description>
                  <value>116</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div117</name>
                  <description>pll_n_ck = vco_ck / 117</description>
                  <value>117</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div118</name>
                  <description>pll_n_ck = vco_ck / 118</description>
                  <value>118</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div119</name>
                  <description>pll_n_ck = vco_ck / 119</description>
                  <value>119</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div120</name>
                  <description>pll_n_ck = vco_ck / 120</description>
                  <value>120</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div121</name>
                  <description>pll_n_ck = vco_ck / 121</description>
                  <value>121</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div122</name>
                  <description>pll_n_ck = vco_ck / 122</description>
                  <value>122</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div123</name>
                  <description>pll_n_ck = vco_ck / 123</description>
                  <value>123</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div124</name>
                  <description>pll_n_ck = vco_ck / 124</description>
                  <value>124</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div125</name>
                  <description>pll_n_ck = vco_ck / 125</description>
                  <value>125</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div126</name>
                  <description>pll_n_ck = vco_ck / 126</description>
                  <value>126</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div127</name>
                  <description>pll_n_ck = vco_ck / 127</description>
                  <value>127</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLPEN</name>
              <description>Main PLL PLL P clock output enable
Set and reset by software to enable the PLL P clock output of the PLL.
In order to save power, when the PLL P clock output of the PLL is not used, the value of PLLPEN should be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLP</name>
              <description>Main PLL division factor for PLL P clock.
Set and cleared by software to control the frequency of the main PLL output clock PLL P clock. These bits can be written only if PLL is disabled.
When the PLLPDIV[4:0] is set to 00000PLL P output clock frequency = VCO frequency / PLLP with PLLP =7, or 17
Note: The software has to set these bits correctly not to exceed 170 MHz on this domain.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLP</name>
                <enumeratedValue>
                  <name>Div7</name>
                  <description>pll_p_ck = vco_ck / 7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div17</name>
                  <description>pll_p_ck = vco_ck / 17</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLQEN</name>
              <description>Main PLL Q clock output enable
Set and reset by software to enable the PLL Q clock output of the PLL.
In order to save power, when the PLL Q clock output of the PLL is not used, the value of PLLQEN should be 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLQ</name>
              <description>Main PLL division factor for PLL Q clock.
Set and cleared by software to control the frequency of the main PLL output clock PLL Q clock. This output can be selected for USB, RNG, SAI (48 MHz clock). These bits can be written only if PLL is disabled.
PLL Q output clock frequency = VCO frequency / PLLQ with PLLQ = 2, 4, 6, or 8
Note: The software has to set these bits correctly not to exceed 170 MHz on this domain.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLQ</name>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>pll_q_ck = vco_ck / 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>pll_q_ck = vco_ck / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>pll_q_ck = vco_ck / 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>pll_q_ck = vco_ck / 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLREN</name>
              <description>PLL R clock output enable
Set and reset by software to enable the PLL R clock output of the PLL (used as system clock).
This bit cannot be written when PLL R clock output of the PLL is used as System Clock.
In order to save power, when the PLL R clock output of the PLL is not used, the value of PLLREN should be 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLR</name>
              <description>Main PLL division factor for PLL R clock (system clock)
Set and cleared by software to control the frequency of the main PLL output clock PLLCLK. This output can be selected as system clock. These bits can be written only if PLL is disabled.
PLL R output clock frequency = VCO frequency / PLLR with PLLR = 2, 4, 6, or 8
Note: The software has to set these bits correctly not to exceed 170 MHz on this domain.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLR</name>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>pll_r_ck = vco_ck / 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>pll_r_ck = vco_ck / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>pll_r_ck = vco_ck / 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>pll_r_ck = vco_ck / 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLPDIV</name>
              <description>Main PLLP division factor
Set and cleared by software to control the PLL P frequency. PLL P output clock frequency = VCO frequency / PLLPDIV.
....</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLLPDIV</name>
                <enumeratedValue>
                  <name>PLLP</name>
                  <description>pll_p_ck is controlled by PLLP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>pll_p_ck = vco_ck / 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div3</name>
                  <description>pll_p_ck = vco_ck / 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>pll_p_ck = vco_ck / 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div5</name>
                  <description>pll_p_ck = vco_ck / 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>pll_p_ck = vco_ck / 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div7</name>
                  <description>pll_p_ck = vco_ck / 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>pll_p_ck = vco_ck / 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div9</name>
                  <description>pll_p_ck = vco_ck / 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>pll_p_ck = vco_ck / 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div11</name>
                  <description>pll_p_ck = vco_ck / 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>pll_p_ck = vco_ck / 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div13</name>
                  <description>pll_p_ck = vco_ck / 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div14</name>
                  <description>pll_p_ck = vco_ck / 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div15</name>
                  <description>pll_p_ck = vco_ck / 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>pll_p_ck = vco_ck / 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div17</name>
                  <description>pll_p_ck = vco_ck / 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div18</name>
                  <description>pll_p_ck = vco_ck / 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div19</name>
                  <description>pll_p_ck = vco_ck / 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div20</name>
                  <description>pll_p_ck = vco_ck / 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div21</name>
                  <description>pll_p_ck = vco_ck / 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div22</name>
                  <description>pll_p_ck = vco_ck / 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div23</name>
                  <description>pll_p_ck = vco_ck / 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div24</name>
                  <description>pll_p_ck = vco_ck / 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div25</name>
                  <description>pll_p_ck = vco_ck / 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div26</name>
                  <description>pll_p_ck = vco_ck / 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div27</name>
                  <description>pll_p_ck = vco_ck / 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div28</name>
                  <description>pll_p_ck = vco_ck / 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div29</name>
                  <description>pll_p_ck = vco_ck / 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div30</name>
                  <description>pll_p_ck = vco_ck / 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div31</name>
                  <description>pll_p_ck = vco_ck / 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the LSI oscillator stabilization.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the LSE oscillator stabilization.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI16 ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the HSI16 oscillator stabilization.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the HSE oscillator stabilization.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by PLL lock.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSECSSIE</name>
              <description>LSE clock security system interrupt enable
Set and cleared by software to enable/disable interrupt caused by the clock security system on LSE.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <description>HSI48 ready interrupt enable 
Set and cleared by software to enable/disable interrupt caused by the internal HSI48 oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
