ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>CCIPR</name>
          <displayName>CCIPR</displayName>
          <description>Peripherals independent clock configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1 clock source selection
This bit is set and cleared by software to select the USART1 clock source.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART2SEL</name>
              <description>USART2 clock source selection
This bit is set and cleared by software to select the USART2 clock source.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART3 clock source selection
This bit is set and cleared by software to select the USART3 clock source.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART4 clock source selection
This bit is set and cleared by software to select the UART4 clock source.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>UART4SEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>PCLK clock selected as UART clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>System</name>
                  <description>System clock (SYSCLK) selected as UART clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 clock selected as UART clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock selected as UART clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>UART5 clock source selection
These bits are set and cleared by software to select the UART5 clock source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="UART4SEL"/>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <description>LPUART1 clock source selection
These bits are set and cleared by software to select the LPUART1 clock source.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="UART4SEL"/>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1 clock source selection
These bits are set and cleared by software to select the I2C1 clock source.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>I2C1SEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>PCLK clock selected as I2C clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>System</name>
                  <description>System clock (SYSCLK) selected as I2C clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 clock selected as I2C clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>I2C2 clock source selection
These bits are set and cleared by software to select the I2C2 clock source.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I2C1SEL"/>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3 clock source selection
These bits are set and cleared by software to select the I2C3 clock source.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I2C1SEL"/>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>Low power timer 1 clock source selection
These bits are set and cleared by software to select the LPTIM1 clock source.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>LPTIM1SEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>PCLK clock selected as LPTIM1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI clock selected as LPTIM1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 clock selected as LPTIM1 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock selected as LPTIM1 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SEL</name>
              <description>clock source selection
These bits are set and cleared by software to select the SAI clock source.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SAI1SEL</name>
                <enumeratedValue>
                  <name>System</name>
                  <description>System clock selected as SAI clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLQ</name>
                  <description>PLL 'Q' clock selected as SAI clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <description>Clock provided on I2S_CKIN pin is selected as SAI clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 clock selected as SAI clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S23SEL</name>
              <description>clock source selection
These bits are set and cleared by software to select the I2S23 clock source.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>I2S23SEL</name>
                <enumeratedValue>
                  <name>System</name>
                  <description>System clock selected as I2S23 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLQ</name>
                  <description>PLL 'Q' clock selected as I2S23 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <description>Clock provided on I2S_CKIN pin is selected as I2S23 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI16</name>
                  <description>HSI16 clock selected as I2S23 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>None</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FDCANSEL</name>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as FDCAN clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLQ</name>
                  <description>PLL 'Q' clock selected as FDCAN clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>PCLK clock selected as FDCAN clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK48SEL</name>
              <description>48 MHz clock source selection
These bits are set and cleared by software to select the 48 MHz clock source used by USB device FS and RNG.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CLK48SEL</name>
                <enumeratedValue>
                  <name>HSI48</name>
                  <description>HSI48 clock selected as 48MHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLQ</name>
                  <description>PLL 'Q' (PLL48M1CLK) clock selected as 48MHz clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SEL</name>
              <description>ADC1/2 clock source selection
These bits are set and cleared by software to select the clock source used by the ADC interface.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADC12SEL</name>
                <enumeratedValue>
                  <name>None</name>
                  <description>No clock selected for ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLP</name>
                  <description>PLL 'P' clock selected for ADC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>System</name>
                  <description>System clock selected for ADC</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC345SEL</name>
              <description>ADC3/4/5 clock source selection
These bits are set and cleared by software to select the clock source used by the ADC345 interface.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="ADC12SEL"/>
            </field>
          </fields>
        </register>
