ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>SWIER1</name>
          <displayName>SWIER1</displayName>
          <description>Software interrupt event           register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWI0</name>
              <description>Software Interrupt on line               0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SoftwareInterrupt</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Pend</name>
                  <description>Generates an interrupt request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI1</name>
              <description>Software Interrupt on line               1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI2</name>
              <description>Software Interrupt on line               2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI3</name>
              <description>Software Interrupt on line               3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI4</name>
              <description>Software Interrupt on line               4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI5</name>
              <description>Software Interrupt on line               5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI6</name>
              <description>Software Interrupt on line               6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI7</name>
              <description>Software Interrupt on line               7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI8</name>
              <description>Software Interrupt on line               8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI9</name>
              <description>Software Interrupt on line               9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI10</name>
              <description>Software Interrupt on line               10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI11</name>
              <description>Software Interrupt on line               11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI12</name>
              <description>Software Interrupt on line               12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI13</name>
              <description>Software Interrupt on line               13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI14</name>
              <description>Software Interrupt on line               14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI15</name>
              <description>Software Interrupt on line               15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI16</name>
              <description>Software Interrupt on line               16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI19</name>
              <description>Software Interrupt on line               19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI20</name>
              <description>Software Interrupt on line               20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI21</name>
              <description>Software Interrupt on line               21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI22</name>
              <description>Software Interrupt on line               22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
            <field>
              <name>SWI17</name>
              <description>Software Interrupt on line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SoftwareInterrupt"/>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1</name>
          <displayName>PR1</displayName>
          <description>Pending register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIF0</name>
              <description>Pending bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>PIF0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>No trigger request occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Selected trigger request occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>PIF0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears pending bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF1</name>
              <description>Pending bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF2</name>
              <description>Pending bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF3</name>
              <description>Pending bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF4</name>
              <description>Pending bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF5</name>
              <description>Pending bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF6</name>
              <description>Pending bit 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF7</name>
              <description>Pending bit 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF8</name>
              <description>Pending bit 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF9</name>
              <description>Pending bit 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF10</name>
              <description>Pending bit 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF11</name>
              <description>Pending bit 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF12</name>
              <description>Pending bit 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF13</name>
              <description>Pending bit 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF14</name>
              <description>Pending bit 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF15</name>
              <description>Pending bit 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF16</name>
              <description>Pending bit 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF19</name>
              <description>Pending bit 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF20</name>
              <description>Pending bit 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF21</name>
              <description>Pending bit 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF22</name>
              <description>Pending bit 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>PIF17</name>
              <description>Pending bit 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues derivedFrom="PIF0R">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="PIF0W">
                <usage>write</usage>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR2</name>
          <displayName>IMR2</displayName>
          <description>Interrupt mask register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFF87</resetValue>
          <fields>
            <field>
              <name>IM32</name>
              <description>Interrupt Mask on external/internal line               32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>InterruptMask</name>
                <enumeratedValue>
                  <name>Masked</name>
                  <description>Interrupt request line is masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmasked</name>
                  <description>Interrupt request line is unmasked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM33</name>
              <description>Interrupt Mask on external/internal line               33</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM34</name>
              <description>Interrupt Mask on external/internal line               34</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM35</name>
              <description>Interrupt Mask on external/internal line               35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM36</name>
              <description>Interrupt Mask on external/internal line               36</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM37</name>
              <description>Interrupt Mask on external/internal line               37</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM40</name>
              <description>Interrupt Mask on external/internal line               40</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM41</name>
              <description>Interrupt Mask on external/internal line               41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM42</name>
              <description>Interrupt Mask on external/internal line               42</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
            <field>
              <name>IM43</name>
              <description>Interrupt Mask on external/internal line               43</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="InterruptMask"/>
            </field>
          </fields>
        </register>
