ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP</name>
      <description>Operational amplifiers</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x40010300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OPAMP1_CSR</name>
          <displayName>OPAMP1_CSR</displayName>
          <description>OPAMP1 control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>Operational amplifier               Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OPAEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OpAmp disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OpAmp enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_VP</name>
              <description>FORCE_VP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FORCE_VP</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Non-inverting input connected configured inputs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CalibrationVerification</name>
                  <description>Non-inverting input connected to calibration reference voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>VP_SEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VP_SEL</name>
                <enumeratedValue>
                  <name>VINP0</name>
                  <description>VINP0 connected to VINP input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP1</name>
                  <description>VINP1 connected to VINP input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP2</name>
                  <description>VINP2 connected to VINP input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC3_CH1</name>
                  <description>DAC3_CH1 connected to VINP input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USERTRIM</name>
              <description>USERTRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>USERTRIM</name>
                <enumeratedValue>
                  <name>Factory</name>
                  <description>Factory trim used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>User</name>
                  <description>User trim used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>VM_SEL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VM_SEL</name>
                <enumeratedValue>
                  <name>VINM0</name>
                  <description>VINM0 connected to VINM input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINM1</name>
                  <description>VINM1 connected to VINM input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>Feedback resistor connected to VINM (PGA mode)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>OpAmp output connected to VINM (Follower mode)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAHSM</name>
              <description>OPAHSM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OPAHSM</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>OpAmp in normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HighSpeed</name>
                  <description>OpAmp in high speed mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAINTOEN</name>
              <description>OPAINTOEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OPAINTOEN</name>
                <enumeratedValue>
                  <name>OutputPin</name>
                  <description>Output is connected to the output Pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCChannel</name>
                  <description>Output is connected internally to ADC channel</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALON</name>
              <description>CALON</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CALON</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Calibration mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Calibration mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSEL</name>
              <description>CALSEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CALSEL</name>
                <enumeratedValue>
                  <name>Percent3_3</name>
                  <description>0.033*VDDA applied to OPAMP inputs during calibration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Percent10</name>
                  <description>0.1*VDDA applied to OPAMP inputs during calibration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Percent50</name>
                  <description>0.5*VDDA applied to OPAMP inputs during calibration</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Percent90</name>
                  <description>0.9*VDDA applied to OPAMP inputs during calibration</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>PGA_GAIN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>PGA_GAIN</name>
                <enumeratedValue>
                  <name>Gain2</name>
                  <description>Gain 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain4</name>
                  <description>Gain 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain8</name>
                  <description>Gain 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain16</name>
                  <description>Gain 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain32</name>
                  <description>Gain 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain64</name>
                  <description>Gain 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain2_InputVINM0</name>
                  <description>Gain 2, input/bias connected to VINM0 or inverting gain</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain4_InputVINM0</name>
                  <description>Gain 4, input/bias connected to VINM0 or inverting gain</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain8_InputVINM0</name>
                  <description>Gain 8, input/bias connected to VINM0 or inverting gain</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain16_InputVINM0</name>
                  <description>Gain 16, input/bias connected to VINM0 or inverting gain</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain32_InputVINM0</name>
                  <description>Gain 32, input/bias connected to VINM0 or inverting gain</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain64_InputVINM0</name>
                  <description>Gain 64, input/bias connected to VINM0 or inverting gain</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain2_FilteringVINM0</name>
                  <description>Gain 2, with filtering on VINM0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain4_FilteringVINM0</name>
                  <description>Gain 4, with filtering on VINM0</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain8_FilteringVINM0</name>
                  <description>Gain 8, with filtering on VINM0</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain16_FilteringVINM0</name>
                  <description>Gain 16, with filtering on VINM0</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain32_FilteringVINM0</name>
                  <description>Gain 32, with filtering on VINM0</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain64_FilteringVINM0</name>
                  <description>Gain 64, with filtering on VINM0</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain2_InputVINM0FilteringVINM1</name>
                  <description>Gain 2, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain4_InputVINM0FilteringVINM1</name>
                  <description>Gain 4, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain8_InputVINM0FilteringVINM1</name>
                  <description>Gain 8, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain16_InputVINM0FilteringVINM1</name>
                  <description>Gain 16, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain32_InputVINM0FilteringVINM1</name>
                  <description>Gain 32, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain64_InputVINM0FilteringVINM1</name>
                  <description>Gain 64, input/bias connected to VINM0 with filtering on VINM1 or inverting gain</description>
                  <value>29</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMOFFSETP</name>
              <description>TRIMOFFSETP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIMOFFSETN</name>
              <description>TRIMOFFSETN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CALOUT</name>
              <description>CALOUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCK</name>
                <enumeratedValue>
                  <name>ReadWrite</name>
                  <description>CSR is read-write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ReadOnly</name>
                  <description>CSR is read-only, can only be cleared by system reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP2_CSR</name>
          <displayName>OPAMP2_CSR</displayName>
          <description>OPAMP2 control/status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAEN">
              <name>OPAEN</name>
              <description>Operational amplifier               Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.FORCE_VP">
              <name>FORCE_VP</name>
              <description>FORCE_VP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>VP_SEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VP_SEL</name>
                <enumeratedValue>
                  <name>VINP0</name>
                  <description>VINP0 connected to VINP input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP1</name>
                  <description>VINP1 connected to VINP input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP2</name>
                  <description>VINP2 connected to VINP input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP3</name>
                  <description>VINP3 connected to VINP input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.USERTRIM">
              <name>USERTRIM</name>
              <description>USERTRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.VM_SEL">
              <name>VM_SEL</name>
              <description>VM_SEL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAHSM">
              <name>OPAHSM</name>
              <description>OPAHSM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAINTOEN">
              <name>OPAINTOEN</name>
              <description>OPAINTOEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALON">
              <name>CALON</name>
              <description>CALON</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALSEL">
              <name>CALSEL</name>
              <description>CALSEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.PGA_GAIN">
              <name>PGA_GAIN</name>
              <description>PGA_GAIN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.TRIMOFFSETP">
              <name>TRIMOFFSETP</name>
              <description>TRIMOFFSETP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.TRIMOFFSETN">
              <name>TRIMOFFSETN</name>
              <description>TRIMOFFSETN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALOUT">
              <name>CALOUT</name>
              <description>CALOUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.LOCK">
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
