ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>OPAMP3_CSR</name>
          <displayName>OPAMP3_CSR</displayName>
          <description>OPAMP3 control/status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAEN">
              <name>OPAEN</name>
              <description>Operational amplifier               Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.FORCE_VP">
              <name>FORCE_VP</name>
              <description>FORCE_VP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>VP_SEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VP_SEL</name>
                <enumeratedValue>
                  <name>VINP0</name>
                  <description>VINP0 connected to VINP input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP1</name>
                  <description>VINP1 connected to VINP input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP2</name>
                  <description>VINP2 connected to VINP input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC3_CH2</name>
                  <description>DAC3_CH2 connected to VINP input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.USERTRIM">
              <name>USERTRIM</name>
              <description>USERTRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.VM_SEL">
              <name>VM_SEL</name>
              <description>VM_SEL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAHSM">
              <name>OPAHSM</name>
              <description>OPAHSM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.OPAINTOEN">
              <name>OPAINTOEN</name>
              <description>OPAINTOEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALON">
              <name>CALON</name>
              <description>CALON</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALSEL">
              <name>CALSEL</name>
              <description>CALSEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.PGA_GAIN">
              <name>PGA_GAIN</name>
              <description>PGA_GAIN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.TRIMOFFSETP">
              <name>TRIMOFFSETP</name>
              <description>TRIMOFFSETP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.TRIMOFFSETN">
              <name>TRIMOFFSETN</name>
              <description>TRIMOFFSETN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.CALOUT">
              <name>CALOUT</name>
              <description>CALOUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.LOCK">
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP1_TCMR</name>
          <displayName>OPAMP1_TCMR</displayName>
          <description>OPAMP1 control/status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VMS_SEL</name>
              <description>VMS_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_CSR.VP_SEL">
              <name>VPS_SEL</name>
              <description>VPS_SEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>T1CM_EN</name>
              <description>T1CM_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>T1CM_EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Automatic input switch triggered by TIM1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Automatic input switch triggered by TIM1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T8CM_EN</name>
              <description>T8CM_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>T8CM_EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Automatic input switch triggered by TIM8 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Automatic input switch triggered by TIM8 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T20CM_EN</name>
              <description>T20CM_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>T20CM_EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Automatic input switch triggered by TIM20 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Automatic input switch triggered by TIM20 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCK</name>
                <enumeratedValue>
                  <name>ReadWrite</name>
                  <description>TCMR is read-write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ReadOnly</name>
                  <description>TCMR is read-only, can only be cleared by system reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP2_TCMR</name>
          <displayName>OPAMP2_TCMR</displayName>
          <description>OPAMP2 control/status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.VMS_SEL">
              <name>VMS_SEL</name>
              <description>VMS_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP2_CSR.VP_SEL">
              <name>VPS_SEL</name>
              <description>VPS_SEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T1CM_EN">
              <name>T1CM_EN</name>
              <description>T1CM_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T8CM_EN">
              <name>T8CM_EN</name>
              <description>T8CM_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T20CM_EN">
              <name>T20CM_EN</name>
              <description>T20CM_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.LOCK">
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP3_TCMR</name>
          <displayName>OPAMP3_TCMR</displayName>
          <description>OPAMP3 control/status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.VMS_SEL">
              <name>VMS_SEL</name>
              <description>VMS_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP3_CSR.VP_SEL">
              <name>VPS_SEL</name>
              <description>VPS_SEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T1CM_EN">
              <name>T1CM_EN</name>
              <description>T1CM_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T8CM_EN">
              <name>T8CM_EN</name>
              <description>T8CM_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.T20CM_EN">
              <name>T20CM_EN</name>
              <description>T20CM_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="OPAMP.OPAMP1_TCMR.LOCK">
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
