ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>STMODR</name>
          <displayName>STMODR</displayName>
          <description>Sawtooth Mode register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x10</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>STRSTTRIGSEL%s</name>
              <description>DAC Channel 1 Sawtooth Reset trigger               selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>STRSTTRIGSEL1</name>
                <enumeratedValue>
                  <name>Swtrig</name>
                  <description>Software trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim1or8Trgo</name>
                  <description>Timer 8 (DAC1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim7Trgo</name>
                  <description>Timer 7 TRGO event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim15Trgo</name>
                  <description>Timer 15 TRGO event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim2Trgo</name>
                  <description>Timer 2 TRGO event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim4Trgo</name>
                  <description>Timer 4 TRGO event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exti9</name>
                  <description>EXTI line 9</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim6Trgo</name>
                  <description>Timer 6 TRGO event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim3Trgo</name>
                  <description>Timer 3 TRGO event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset1</name>
                  <description>hrtim_dac_reset_trg1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset2</name>
                  <description>hrtim_dac_reset_trg2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset3</name>
                  <description>hrtim_dac_reset_trg3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset4</name>
                  <description>hrtim_dac_reset_trg4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset5</name>
                  <description>hrtim_dac_reset_trg5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacReset6</name>
                  <description>hrtim_dac_reset_trg6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacX</name>
                  <description>hrtim_dac_trg1 (DAC1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x10</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>STINCTRIGSEL%s</name>
              <description>DAC Channel %s Sawtooth Increment trigger               selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>STINCTRIGSEL1</name>
                <enumeratedValue>
                  <name>Swtrig</name>
                  <description>Software sawtooth increment trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim1or8Trgo</name>
                  <description>Timer 8 (DAC1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim7Trgo</name>
                  <description>Timer 7 TRGO event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim15Trgo</name>
                  <description>Timer 15 TRGO event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim2Trgo</name>
                  <description>Timer 2 TRGO event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim4Trgo</name>
                  <description>Timer 4 TRGO event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exti10</name>
                  <description>EXTI line 10</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim6Trgo</name>
                  <description>Timer 6 TRGO event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tim3Trgo</name>
                  <description>Timer 3 TRGO event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep1</name>
                  <description>hrtim_dac_step_trg1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep2</name>
                  <description>hrtim_dac_step_trg2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep3</name>
                  <description>hrtim_dac_step_trg3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep4</name>
                  <description>hrtim_dac_step_trg4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep5</name>
                  <description>hrtim_dac_step_trg5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HrtimDacStep6</name>
                  <description>hrtim_dac_step_trg6</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
