ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>CORDIC Co-processor</description>
      <groupName>CORDIC</groupName>
      <baseAddress>0x40020C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Cordic</name>
        <description>Cordic</description>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>CORDIC Control Status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FUNC</name>
              <description>FUNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>FUNC</name>
                <enumeratedValue>
                  <name>Cosine</name>
                  <description>Cosine function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sine</name>
                  <description>Sine function</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Phase</name>
                  <description>Phase function</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Modulus</name>
                  <description>Modulus function</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Arctangent</name>
                  <description>Arctangent function</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HyperbolicCosine</name>
                  <description>Hyperbolic Cosine function</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HyperbolicSine</name>
                  <description>Hyperbolic Sine function</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Arctanh</name>
                  <description>Arctanh function</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NaturalLogarithm</name>
                  <description>Natural Logarithm function</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SquareRoot</name>
                  <description>Square Root function</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRECISION</name>
              <description>Precision (number of iterations/cycles) required</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PRECISION</name>
                <enumeratedValue>
                  <name>Iters4</name>
                  <description>4 iterations</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters8</name>
                  <description>8 iterations</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters12</name>
                  <description>12 iterations</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters16</name>
                  <description>16 iterations</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters20</name>
                  <description>20 iterations</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters24</name>
                  <description>24 iterations</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters28</name>
                  <description>28 iterations</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters32</name>
                  <description>32 iterations</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters36</name>
                  <description>36 iterations</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters40</name>
                  <description>40 iterations</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters44</name>
                  <description>44 iterations</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters48</name>
                  <description>48 iterations</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters52</name>
                  <description>52 iterations</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters56</name>
                  <description>56 iterations</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Iters60</name>
                  <description>60 iterations</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor (2^-n for arguments, 2^n for results)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IEN</name>
              <description>IEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable interrupt request generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable interrupt request generation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAREN</name>
              <description>DMAREN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMAREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No DMA channel reads are generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read requests are generated on the DMA channel when RRDY flag is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAWEN</name>
              <description>DMAWEN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMAWEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No DMA channel writes are generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write requests are generated on the DMA channel when no operation is pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRES</name>
              <description>NRES</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>NRES</name>
                <enumeratedValue>
                  <name>Num1</name>
                  <description>Only single result value will be returned. After a single read RRDY will be automatically cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Num2</name>
                  <description>Two return reads need to be performed. After two reads RRDY will be automatically cleared</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NARGS</name>
              <description>NARGS</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>NARGS</name>
                <enumeratedValue>
                  <name>Num1</name>
                  <description>Only single argument write is needed for next calculation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Num2</name>
                  <description>Two argument writes need to be performed for next calculation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESSIZE</name>
              <description>RESSIZE</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RESSIZE</name>
                <enumeratedValue>
                  <name>Bits32</name>
                  <description>Use 32 bit output values</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits16</name>
                  <description>Use 16 bit output values</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARGSIZE</name>
              <description>ARGSIZE</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ARGSIZE</name>
                <enumeratedValue>
                  <name>Bits32</name>
                  <description>Use 32 bit input values</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits16</name>
                  <description>Use 16 bit input values</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRDY</name>
              <description>RRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RRDYR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Results from computation are not read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Results are ready, this flag will be automatically cleared once value is read</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDATA</name>
          <displayName>WDATA</displayName>
          <description>CORDIC argument register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARG</name>
              <description>ARG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>CORDIC result register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RES</name>
              <description>RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
