ram2424/Rust-Programming/rusty-blink/stm32g431.svd.svd
        <register>
          <name>BCDR</name>
          <description>Battery Charging Detector</description>
          <addressOffset>0x58</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPPU</name>
              <description>DP pull-up control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DPPU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>signalize disconnect to the host when needed by the user software</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>enable the embedded pull-up on the DP line</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS2DET</name>
              <description>DM pull-up detection status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PS2DET</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal port detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS2</name>
                  <description>PS2 port or proprietary charger detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDET</name>
              <description>Secondary detection status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SDET</name>
                <enumeratedValue>
                  <name>CDP</name>
                  <description>CDP detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP</name>
                  <description>DCP detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDET</name>
              <description>Primary detection status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PDET</name>
                <enumeratedValue>
                  <name>NoBCD</name>
                  <description>no BCD support detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCD</name>
                  <description>BCD support detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDET</name>
              <description>Data contact detection status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>DCDET</name>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>data lines contact not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>data lines contact detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDEN</name>
              <description>Secondary detection mode enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SDEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secondary detection (SD) mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secondary detection (SD) mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN</name>
              <description>Primary detection mode enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PDEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Primary detection (PD) mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Primary detection (PD) mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDEN</name>
              <description>Data contact detection mode enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DCDEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Data contact detection (DCD) mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Data contact detection (DCD) mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCDEN</name>
              <description>Battery charging detector mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>BCDEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>disable the BCD support</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>enable the BCD support within the USB device</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
